<svg class="footer-waves" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" viewBox="0 671.41 1920 409.59"><path d="M0 742L45.7 759C91.3 776 182.7 810 274.2 798.2C365.7 786.3 457.3 728.7 548.8 725.3C640.3 722 731.7 773 823 804C914.3 835 1005.7 846 1097 806.8C1188.3 767.7 1279.7 678.3 1371.2 671.8C1462.7 665.3 1554.3 741.7 1645.8 790.2C1737.3 838.7 1828.7 859.3 1874.3 869.7L1920 880L1920 1081L1874.3 1081C1828.7 1081 1737.3 1081 1645.8 1081C1554.3 1081 1462.7 1081 1371.2 1081C1279.7 1081 1188.3 1081 1097 1081C1005.7 1081 914.3 1081 823 1081C731.7 1081 640.3 1081 548.8 1081C457.3 1081 365.7 1081 274.2 1081C182.7 1081 91.3 1081 45.7 1081L0 1081Z" fill="#5c9343"/><path d="M0 806L45.7 821.5C91.3 837 182.7 868 274.2 882.5C365.7 897 457.3 895 548.8 879.8C640.3 864.7 731.7 836.3 823 823.5C914.3 810.7 1005.7 813.3 1097 825.7C1188.3 838 1279.7 860 1371.2 846.2C1462.7 832.3 1554.3 782.7 1645.8 764C1737.3 745.3 1828.7 757.7 1874.3 763.8L1920 770L1920 1081L1874.3 1081C1828.7 1081 1737.3 1081 1645.8 1081C1554.3 1081 1462.7 1081 1371.2 1081C1279.7 1081 1188.3 1081 1097 1081C1005.7 1081 914.3 1081 823 1081C731.7 1081 640.3 1081 548.8 1081C457.3 1081 365.7 1081 274.2 1081C182.7 1081 91.3 1081 45.7 1081L0 1081Z" fill="#487435"/><path d="M0 859L45.7 866.2C91.3 873.3 182.7 887.7 274.2 873.3C365.7 859 457.3 816 548.8 825.2C640.3 834.3 731.7 895.7 823 925.7C914.3 955.7 1005.7 954.3 1097 929.8C1188.3 905.3 1279.7 857.7 1371.2 831.7C1462.7 805.7 1554.3 801.3 1645.8 819.8C1737.3 838.3 1828.7 879.7 1874.3 900.3L1920 921L1920 1081L1874.3 1081C1828.7 1081 1737.3 1081 1645.8 1081C1554.3 1081 1462.7 1081 1371.2 1081C1279.7 1081 1188.3 1081 1097 1081C1005.7 1081 914.3 1081 823 1081C731.7 1081 640.3 1081 548.8 1081C457.3 1081 365.7 1081 274.2 1081C182.7 1081 91.3 1081 45.7 1081L0 1081Z" fill="#365627"/><path d="M0 960L45.7 949.7C91.3 939.3 182.7 918.7 274.2 924.5C365.7 930.3 457.3 962.7 548.8 967.2C640.3 971.7 731.7 948.3 823 944.2C914.3 940 1005.7 955 1097 946.2C1188.3 937.3 1279.7 904.7 1371.2 902.5C1462.7 900.3 1554.3 928.7 1645.8 947.2C1737.3 965.7 1828.7 974.3 1874.3 978.7L1920 983L1920 1081L1874.3 1081C1828.7 1081 1737.3 1081 1645.8 1081C1554.3 1081 1462.7 1081 1371.2 1081C1279.7 1081 1188.3 1081 1097 1081C1005.7 1081 914.3 1081 823 1081C731.7 1081 640.3 1081 548.8 1081C457.3 1081 365.7 1081 274.2 1081C182.7 1081 91.3 1081 45.7 1081L0 1081Z" fill="#243a1a"/></svg>
    <footer>
        <div class="footer-content">
            <div class="footer-navigation">
                <a href="<?= home_url(); ?>" >
                    <img src="<?= get_template_directory_uri() . "/assets/img/" ?>wachseldorn.svg" alt="Home">
                </a>
                <a class="link-white" href="<?= home_url() . "/wp-admin/"; ?>" target="_blank" rel="noopener">Login➚</a>
            </div>
            <div class="footer-info">
                <div>
                    <h2>Öffnungszeiten</h2>
                    <table>
                        <tbody>
                        <tr>
                            <td>Dienstag</td>
                            <td>07.30 Uhr bis 11.30 Uhr</td>
                        </tr>
                        <tr>
                            <td>Donnerstag</td>
                            <td>07.00 Uhr bis 11.30 Uhr</td>
                        </tr>
                        </tbody>
                    </table>
                    <p>Telefonisch sind wir täglich unter der Telefonnummer <a class="link-white" href="tel:0334531054">033 453 10 54</a> erreichbar.</p>
                </div>
                <div>
                    <h2>Adresse</h2>
                    <p>Süderen 63 a, 3618 Süderen</p>
                </div>
            </div>
            <?php
            wp_nav_menu(array(
                'theme_location' => 'footer',
                'container' => '',
            ));
            ?>
            <hr>
            <div class="footer-cred">
                <a class="link-white" href="<?= home_url(); ?>">Gemeinde Wachseldorn</a>
                <a class="link-white" href="https://damian.work" target="_blank" rel="noopener">&copy;2024 by Damian</a>
                <div>
                    <a class="link-white" href="<?php echo home_url() . '/datenschutz' ?>">Datenschutzerklärung</a><span style="color: #ffffff;"> |</span>
                    <a class="link-white" href="<?php echo home_url() . '/impressum' ?>">Impressum</a>
                </div>
            </div>
        </div>
        <?php wp_footer(); ?>
    </footer>

    <button class="topBtn" onclick="scrollToTop()">
        <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" fill="#000000" viewBox="0 0 448 512"><path d="M201.4 137.4c12.5-12.5 32.8-12.5 45.3 0l160 160c12.5 12.5 12.5 32.8 0 45.3s-32.8 12.5-45.3 0L224 205.3 86.6 342.6c-12.5 12.5-32.8 12.5-45.3 0s-12.5-32.8 0-45.3l160-160z"/></svg>
    </button>
</div>